# 01 IMPORTING LIBRARIES

In [24]:
import pandas as pd
import numpy as np
import os

# 02 IMPORTING DATA

In [25]:
path = r'C:\Users\Martin ARAUJO\Documents\Instacart Basket Analysis'

In [26]:
df_prods = pd.read_csv(os.path.join(path, '02- Data', 'Original Data', 'products_FP.csv'))

In [27]:
df_ords = pd.read_csv(os.path.join(path, '02- Data', 'Prepared Data', 'orders_wrangled_FP.csv'))

# 03 CREATING A TEST DATAFRAME

In [28]:
df_test = pd.DataFrame()

# 04 CREATE A MIXED TYPE COLUMN

In [29]:
df_test['mix'] = ['a', 'b', 1, True]

In [30]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

# 05 function for checking whether a dataframe contains any mixed-type columns

In [31]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [32]:
df_test['mix'] = df_test['mix'].astype('str')

In [33]:
df_test['mix'].dtype

dtype('O')

# 06 Missing Values

In [34]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

# displaying missing values

In [35]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [36]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [37]:
df_prods.shape

(49693, 5)

# Deleting the missing values

In [38]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [39]:
df_prods_clean.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [40]:
df_prods_clean.shape

(49677, 5)

# An alternative way, can be using this formula, without creating a new dataframe

# df_prods[‘product_name’].dropna(inplace = True)

# 07 Finding Duplicates

In [41]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [42]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

Next, create a new dataframe that doesn’t include the duplicates you just identified using the drop_duplicates() function:

In [43]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [44]:
df_prods_clean_no_dups

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [45]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02- Data','Prepared Data', 'products_checked_FP.csv'))

# TASK

# 01 If you haven’t performed the consistency checks covered in this Exercise on your df_prods dataframe, do so now.

# 02 Run the df.describe() function on your df_prods dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.
Tip: Keep an eye on min and max values!

In [46]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

I can see that on the product_id variable there is a count of 49.693 rows, and the maximun value is 49.688, so this could mean that we have 5 repeated lines. Also the prices variable seems to have an outlier of 99999.000000

# 03 Check for mixed-type data in your df_ords dataframe.

In [47]:
for col in df_prods.columns.tolist():
  weird = (df_prods[[col]].applymap(type) != df_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods[weird]) > 0:
    print (col)

product_name

    converting the product_name variable into a string

In [48]:
df_prods['product_name'] = df_prods['product_name'].astype('str')

In [49]:
df_prods['product_name'].dtype

dtype('O')

In [64]:
df_prods_clean_no_dups['product_name'] = df_prods_clean_no_dups['product_name'].astype('str')

<ipython-input-64-c6477ea18b27>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_prods_clean_no_dups['product_name'] = df_prods_clean_no_dups['product_name'].astype('str')

In [65]:
df_prods_clean_no_dups['product_name'].dtype

dtype('O')

In [50]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

No mixed value in the df_ords dataframe

# 04 If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

I didnt find any mixed data type in the df_ords DF, but i did find it in the df_prods DF, under the product_name variable and converted it into a string variable (O)

# 05 Run a check for missing values in your df_ords dataframe. In a markdown cell, report your findings and propose an explanation for any missing values you find.

In [51]:
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_timestamp           0
days_since_prior_order    206209
dtype: int64

In [52]:
df_ords_null_test = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [53]:
df_ords_null_test

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_timestamp,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

All these null values could be because it's the first order that the client make and then it's ok that it has an NaN, as there is no other order to compare.

# 06 Address the missing values using an appropriate method. In a markdown cell, explain why you used your method of choice.

In [54]:
df_ords_NaN = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [55]:
df_ords_NaN

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_timestamp,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [56]:
df_ords_NaN['days_since_prior_order'].fillna(0, inplace=True)

C:\Users\Martin ARAUJO\anaconda3\lib\site-packages\pandas\core\series.py:4463: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [57]:
df_ords_NaN

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_timestamp,days_since_prior_order
0,0,2539329,1,1,2,8,0.0
11,11,2168274,2,1,2,11,0.0
26,26,1374495,3,1,1,14,0.0
39,39,3343014,4,1,6,11,0.0
45,45,2717275,5,1,3,12,0.0
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,0.0
3420934,3420934,3189322,206206,1,3,18,0.0
3421002,3421002,2166133,206207,1,6,19,0.0
3421019,3421019,2227043,206208,1,1,15,0.0
3421069,3421069,3154581,206209,1,3,11,0.0

In [58]:
df_ords_NaN.isnull().sum()

Unnamed: 0                0
order_id                  0
user_id                   0
order_number              0
orders_day_of_week        0
order_hour_timestamp      0
days_since_prior_order    0
dtype: int64

Now that I have tested with df_ords_NaN variable that I can use the function df['column with missings'].fillna(mean value, inplace=True) without any problems, I will change it in the main dataframe

In [59]:
df_ords['days_since_prior_order'].fillna(0, inplace=True)

In [60]:
df_ords.isnull().sum()

Unnamed: 0                0
order_id                  0
user_id                   0
order_number              0
orders_day_of_week        0
order_hour_timestamp      0
days_since_prior_order    0
dtype: int64

# 07 Run a check for duplicate values in your df_ords data. In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

In [61]:
df_duplicated = df_ords[df_ords.duplicated()]

In [62]:
df_duplicated

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_timestamp, days_since_prior_order]
Index: []

There are no duplicated values in the df_ords dataframe

# 08 Address the duplicates using an appropriate method. In a markdown cell, explain why you used your method of choice.

# 09 Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [66]:
df_ords.to_csv(os.path.join(path, '02- Data','Prepared Data', 'orders_checked_FP.csv'))

In [67]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02- Data','Prepared Data', 'products_checked_FP.csv'))